output/cfd/leito_interativo/0/U
/*--------------------------------*- C++ -*----------------------------------*\
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1);

boundaryField
{
    leito
    {
        type            noSlip;
    }
    
    walls
    {
        type            noSlip;
    }
}

// ************************************************************************* //
