output/cfd/leito_interativo/0/p
/*--------------------------------*- C++ -*----------------------------------*\
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leito
    {
        type            zeroGradient;
    }
    
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
