output/cfd/leito_interativo/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1

# source openfoam
source /opt/openfoam11/etc/bashrc

echo "========================================="
echo " executando caso openfoam"
echo "========================================="

echo ""
echo "1. gerando malha de fundo (blockMesh)..."
blockMesh > log.blockMesh 2>&1
if [ $? -ne 0 ]; then
    echo "erro no blockMesh! veja log.blockMesh"
    exit 1
fi
echo "   [OK] malha de fundo criada"

echo ""
echo "2. gerando malha refinada (snappyHexMesh)..."
echo "   (isso pode demorar alguns minutos...)"
snappyHexMesh -overwrite > log.snappyHexMesh 2>&1
if [ $? -ne 0 ]; then
    echo "erro no snappyHexMesh! veja log.snappyHexMesh"
    exit 1
fi
echo "   [OK] malha refinada criada"

echo ""
echo "3. verificando qualidade da malha..."
checkMesh > log.checkMesh 2>&1
echo "   (veja log.checkMesh para detalhes)"

echo ""
echo "4. executando simulacao (simpleFoam)..."
echo "   (monitorando convergencia...)"
simpleFoam > log.simpleFoam 2>&1 &
FOAM_PID=$!

# monitorar convergencia
while kill -0 $FOAM_PID 2>/dev/null; do
    if [ -f log.simpleFoam ]; then
        LAST_TIME=$(grep "^Time = " log.simpleFoam | tail -1)
        printf "   %s" "$LAST_TIME"
    fi
    sleep 2
done
wait $FOAM_PID
FOAM_EXIT=$?

echo ""
if [ $FOAM_EXIT -eq 0 ]; then
    echo "   [OK] simulacao concluida!"
else
    echo "   [ERRO] erro na simulacao! veja log.simpleFoam"
    exit 1
fi

echo ""
echo "========================================="
echo " caso executado com sucesso!"
echo "========================================="
echo ""
echo "proximos passos:"
echo "  - visualizar: touch caso.foam && paraview caso.foam"
echo "  - pos-processar: postProcess -func sample"
echo ""

# criar arquivo .foam para paraview
touch caso.foam

exit 0
